{
  "backend/main.mo": "Motoko backend defining menu items, orders, bookings, user profiles, statuses, Stripe config, and access control with initial state and storage maps.",
  "feature_evidence.json": "Feature evidence report mapping feature requirements to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind CSS setup defining color variables, themes, and base styles for light and dark modes.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/README.md": "Frontend documentation describing features, setup, tech stack, and Razorpay-based payment configuration.",
  "frontend/src/App.tsx": "Main React app defining routes, layout, auth guards, and providers using TanStack Router.",
  "frontend/src/cart/CartProvider.tsx": "React context for cart state with localStorage persistence, item management, and total calculations.",
  "frontend/src/cart/cartStorage.ts": "Utility for serializing and deserializing cart data with BigInt-safe JSON handling.",
  "frontend/src/components/admin/DevResetSection.tsx": "Provides a destructive admin-only dialog to reset all application data after typing RESET for confirmation.",
  "frontend/src/components/admin/KpiCard.tsx": "Displays a KPI value with an icon, title, and optional description in a card layout.",
  "frontend/src/components/admin/RequireAdmin.tsx": "Checks admin status and either renders children or shows an access-denied message.",
  "frontend/src/components/auth/LoginButton.tsx": "Handles Internet Identity login/logout and displays a button that reflects authentication state.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/auth/RequireAuth.tsx": "Requires user authentication and shows a login prompt if the user is not signed in.",
  "frontend/src/components/bookings/BookingStatusBadge.tsx": "Renders a badge displaying booking status based on the status variant object.",
  "frontend/src/components/layout/Footer.tsx": "Renders site footer with links, social icons, and attribution.",
  "frontend/src/components/layout/Navbar.tsx": "Top navigation bar with dynamic links, login button, cart count, and mobile menu.",
  "frontend/src/components/menu/MenuItemCard.tsx": "Shows menu item details, availability, price, and an optional add-to-cart button.",
  "frontend/src/components/menu/MenuSkeletonGrid.tsx": "Displays a grid of skeleton loaders for menu items while data is loading.",
  "frontend/src/components/orders/OrderStatusBadge.tsx": "Renders a badge showing order status with labels and variants based on status fields.",
  "frontend/src/components/payments/PaymentSetup.tsx": "UI dialog for configuring Stripe by submitting a secret key and allowed countries, with validation and mutation to save settings.",
  "frontend/src/hooks/mutations/useBookingAdminMutations.ts": "Provides a mutation to update booking status and refresh related queries with success/error toasts.",
  "frontend/src/hooks/mutations/useDevResetMutation.ts": "Implements a dev reset mutation placeholder that clears client state and logs out, but currently always errors due to missing backend support.",
  "frontend/src/hooks/mutations/useMenuAdminMutations.ts": "Defines mutations to add, update, and delete menu items, invalidating menu-related queries and showing toast feedback.",
  "frontend/src/hooks/mutations/useOrderAdminMutations.ts": "Mutation hook to update order status and refresh order-related queries with toast notifications.",
  "frontend/src/hooks/mutations/useOrderPaymentMutations.ts": "Mutation for updating an order’s payment reference and status while invalidating order queries and handling errors.",
  "frontend/src/hooks/payments/useCreateCheckoutSession.ts": "Creates a Stripe checkout session unless COD-only mode is enabled, handling URL construction and specific error cases.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, invalidating queries when the identity changes.",
  "frontend/src/hooks/useAuthRedirect.ts": "Manages storing and redirecting to intended routes after authentication using session storage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login state, identity loading, and logout through AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines multiple React Query hooks for admin checks, menu data, orders, bookings, dashboard metrics, and Stripe configuration using an actor backend.",
  "frontend/src/index.css": "Configures Tailwind layers and CSS variables for light and dark themes, applying base styling for borders and body colors.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and imports global styles.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard showing metrics, payment setup, order and booking status controls, and alerts for payment configuration.",
  "frontend/src/pages/admin/MenuAdminPage.tsx": "Admin page for listing, adding, editing, and deleting menu items with a form dialog and CRUD operations.",
  "frontend/src/pages/BookChefPage.tsx": "Provides a form for users to submit chef booking requests, handling validation and backend submission.",
  "frontend/src/pages/BookingsPage.tsx": "Displays the user's chef bookings with loading states, empty-state UI, and sorted booking details.",
  "frontend/src/pages/CartPage.tsx": "Manages the shopping cart UI and checkout flow, creating orders after validating user input and authentication.",
  "frontend/src/pages/CheckoutWaitPage.tsx": "Polls order status after checkout, manages timeout and payment method selection, and handles transitions like confirmation or rejection.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing hero section, feature cards, and navigation buttons for browsing the menu or booking the chef.",
  "frontend/src/pages/MenuPage.tsx": "Fetches menu items and categories, groups items by category, and displays them with tabs, loading states, error handling, and add‑to‑cart logic.",
  "frontend/src/pages/OrdersPage.tsx": "Displays the user's past orders with status badges, totals, timestamps, and loading/empty states.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment failure message with navigation options to view orders or continue browsing.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Handles Stripe session verification, updates order payment reference, and displays a payment success confirmation.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and optionally removing them from hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, and container settings while enabling typography, container queries, and animation plugins.",
  "project_state.json": "Defines the project state, including features, new feature requests, metadata, and configuration for the HomeChef Kitchen project."
}