{
  "backend/main.mo": "Defines core backend types and state for menu items, orders, bookings, user profiles, and Stripe config with access control and status helpers.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to modified files, components, and related test IDs.",
  "frontend-file-summaries.txt": "Provides short descriptions for many frontend files used in the project, covering pages, hooks, components, and cart logic.",
  "frontend/index.css": "Tailwind CSS configuration with custom theme variables and dark mode tokens.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/README.md": "Frontend documentation describing features, tech stack, and setup instructions, noting Razorpay as the payment provider.",
  "frontend/src/App.tsx": "Main app router and layout setup with auth‑gated routes and CartProvider wrapping the application.",
  "frontend/src/cart/CartProvider.tsx": "Cart context managing items with BigInt‑safe persistence, add/remove/update actions, and derived totals.",
  "frontend/src/cart/cartStorage.ts": "Serializes and deserializes cart data, converting BigInt fields to/from strings for localStorage.",
  "frontend/src/components/admin/DevResetSection.tsx": "Empty placeholder file for a developer reset section component.",
  "frontend/src/components/admin/KpiCard.tsx": "Reusable KPI card displaying a metric title, value, icon, and optional description.",
  "frontend/src/components/admin/RequireAdmin.tsx": "Checks admin status and either renders children or an access denied message.",
  "frontend/src/components/auth/LoginButton.tsx": "Displays a login/logout button with Internet Identity handling and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Shows a forced profile setup dialog for new authenticated users and saves profile data.",
  "frontend/src/components/auth/RequireAuth.tsx": "Requires authentication, storing intended route and prompting login if unauthenticated.",
  "frontend/src/components/bookings/BookingStatusBadge.tsx": "Renders a badge showing booking status based on variant fields.",
  "frontend/src/components/layout/Footer.tsx": "Displays site footer with links, social icons, and attribution.",
  "frontend/src/components/layout/Navbar.tsx": "Navigation bar with dynamic links, login button, cart badge, and mobile menu.",
  "frontend/src/components/menu/MenuItemCard.tsx": "Card showing menu item details, availability, price, and an add‑to‑cart button.",
  "frontend/src/components/menu/MenuSkeletonGrid.tsx": "Skeleton grid placeholder for loading menu items.",
  "frontend/src/components/orders/OrderStatusBadge.tsx": "Renders a badge representing order status from multiple possible variants.",
  "frontend/src/components/payments/PaymentSetup.tsx": "Dialog for configuring payment provider settings using Stripe configuration hooks.",
  "frontend/src/hooks/mutations/useBookingAdminMutations.ts": "Provides a mutation to update a booking's status, invalidating related queries and showing toasts.",
  "frontend/src/hooks/mutations/useDevResetMutation.ts": "Empty file with no implementation.",
  "frontend/src/hooks/mutations/useMenuAdminMutations.ts": "Defines mutations to add, update, and delete menu items while invalidating menu-related queries and displaying toasts.",
  "frontend/src/hooks/mutations/useOrderAdminMutations.ts": "Provides a mutation to update order status and refresh related queries with success and error toasts.",
  "frontend/src/hooks/payments/useCreateCheckoutSession.ts": "Creates a Stripe checkout session via actor call and returns session info including URL.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the backend actor based on identity, refetching dependent queries when actor changes.",
  "frontend/src/hooks/useAuthRedirect.ts": "Manages storing, retrieving, and redirecting to the intended route after authentication.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, managing login, identity loading, and state handling.",
  "frontend/src/hooks/useQueries.ts": "Provides various queries and mutations for user profiles, admin checks, menu data, orders, bookings, and dashboard metrics.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables and styles for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Renders the admin dashboard with KPI metrics and lists of orders/bookings, allowing status updates via mutation hooks.",
  "frontend/src/pages/admin/MenuAdminPage.tsx": "Provides a UI for admins to view, create, edit, and delete menu items using dialog forms and mutation hooks.",
  "frontend/src/pages/BookChefPage.tsx": "Page for submitting a chef booking request with form validation, actor call, and navigation on success.",
  "frontend/src/pages/BookingsPage.tsx": "Displays the user's chef bookings, handling loading, empty states, and rendering sorted booking cards.",
  "frontend/src/pages/CartPage.tsx": "Manages the shopping cart UI and checkout flow, including order creation and redirecting to a payment session.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero section and feature cards promoting menu browsing and chef booking.",
  "frontend/src/pages/MenuPage.tsx": "Fetches and displays menu items by category with loading/error states and supports adding items to the cart.",
  "frontend/src/pages/OrdersPage.tsx": "Shows the user's past orders, handling loading, empty states, and listing detailed order information.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Informs the user that payment failed and provides navigation options back to the cart or menu.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Processes Stripe session results, updates the order payment reference, and confirms successful payment to the user.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling custom colors, typography, animations, and container settings.",
  "project_state.json": "Describes the project’s current architecture, features, issues, and state metadata for build planning."
}