{
  "backend/main.mo": "Defines core data types and state for menu items, orders, bookings, users, and Stripe config with authorization mixin and basic query functions.",
  "feature_evidence.json": "Feature evidence report linking frontend files to the admin-status-refresh feature with metadata and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing routing, hooks, mutations, UI components, and admin features.",
  "frontend/index.css": "Tailwind CSS setup with custom light/dark theme variables and base styling rules.",
  "frontend/index.html": "Basic HTML shell containing a root div and script entry point for the React app.",
  "frontend/README.md": "Frontend overview explaining features, payment setup via Razorpay, tech stack, and setup instructions.",
  "frontend/src/App.tsx": "Main React app routing structure with layout, protected routes, admin routes, and providers.",
  "frontend/src/cart/CartProvider.tsx": "React context managing cart state with localStorage persistence and item/quantity operations.",
  "frontend/src/cart/cartStorage.ts": "Serialization helpers converting BigInt fields in the cart to and from JSON-safe formats.",
  "frontend/src/components/admin/DevResetSection.tsx": "Placeholder admin component with no implemented content.",
  "frontend/src/components/admin/KpiCard.tsx": "UI component rendering a KPI card with title, value, icon, and optional description.",
  "frontend/src/components/admin/RequireAdmin.tsx": "Route guard that checks admin status and shows an access-denied screen for non-admin users.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with post-login query invalidation for admin and profile data.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal prompting new authenticated users to enter and save profile details before continuing.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wrapper enforcing authentication and showing a login prompt when the user is not signed in.",
  "frontend/src/components/bookings/BookingStatusBadge.tsx": "Badge component that displays a booking's status label and style based on its variant.",
  "frontend/src/components/layout/Footer.tsx": "App footer with branding, navigation links, social icons, and a Caffeine.ai attribution.",
  "frontend/src/components/layout/Navbar.tsx": "Responsive top navigation bar showing links, cart count, admin options, and login controls.",
  "frontend/src/components/menu/MenuItemCard.tsx": "Card displaying a menu item's details, availability, price, and add‑to‑cart option.",
  "frontend/src/components/menu/MenuSkeletonGrid.tsx": "Skeleton grid placeholder shown while menu items are loading.",
  "frontend/src/components/orders/OrderStatusBadge.tsx": "Badge component that shows an order's status with appropriate labeling and variant styling.",
  "frontend/src/components/payments/PaymentSetup.tsx": "Dialog prompting admins to configure Razorpay secret key and allowed countries when unconfigured.",
  "frontend/src/hooks/mutations/useBookingAdminMutations.ts": "React Query mutation for admins to update booking status and refresh related queries.",
  "frontend/src/hooks/mutations/useDevResetMutation.ts": "Empty file with no implementation.",
  "frontend/src/hooks/mutations/useMenuAdminMutations.ts": "Provides React Query mutations for adding, updating, and deleting menu items using the actor and invalidates related menu queries.",
  "frontend/src/hooks/mutations/useOrderAdminMutations.ts": "Defines a mutation to update an order's status and refreshes dashboard and order-related queries on success.",
  "frontend/src/hooks/payments/useCreateCheckoutSession.ts": "Creates a checkout session via the actor using provided shopping items and returns the Stripe session data.",
  "frontend/src/hooks/useActor.ts": "Initializes and provides an authenticated or anonymous actor, recreating it on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useAuthRedirect.ts": "Manages storing and restoring intended routes in session storage to redirect users after authentication.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, identity loading, and related states.",
  "frontend/src/hooks/useQueries.ts": "Defines various React Query hooks for user profiles, admin checks, menu items, orders, and bookings through the actor.",
  "frontend/src/index.css": "Sets up Tailwind CSS base styles and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard showing KPI metrics and allowing order and booking status updates using mutation hooks.",
  "frontend/src/pages/admin/MenuAdminPage.tsx": "Menu administration UI that lists items and supports adding, editing, and deleting menu entries via dialog forms.",
  "frontend/src/pages/BookChefPage.tsx": "Implements a form page for creating chef booking requests using the actor and navigates to bookings after submission.",
  "frontend/src/pages/BookingsPage.tsx": "Displays the user's bookings, handling loading, empty state, sorting, and detailed booking info with status badges.",
  "frontend/src/pages/CartPage.tsx": "Manages the shopping cart UI and checkout flow, including validation, order creation, and Stripe session initiation.",
  "frontend/src/pages/HomePage.tsx": "Renders the marketing homepage with a hero section, feature cards, and navigation to menu and chef booking.",
  "frontend/src/pages/MenuPage.tsx": "Shows all available menu items with category tabs, handles loading and error states, and supports adding items to the cart.",
  "frontend/src/pages/OrdersPage.tsx": "Displays the user's past orders with sorting, status badges, item details, and totals.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a failure message after payment errors with navigation options back to cart or menu.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Processes Stripe session results, updates order payment status, and displays a success message with navigation options.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, storing them in sessionStorage, and managing persisted URL/session parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Project state metadata describing current architecture, requirements, known issues, and feature versions."
}