{
  "kind": "build_request",
  "title": "Restrict checkout to Cash on Delivery only",
  "projectName": "HomeChef Kitchen",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the post-acceptance checkout UI so that the only available payment method is Cash on Delivery (remove/disable Card (Stripe) and QR code payment options), and ensure the user can complete the flow without being redirected to Stripe-related pages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-msg-1"
        ],
        "quotes": [
          "Change the payment method to accept only cash on delivery"
        ]
      },
      "acceptanceCriteria": [
        "On the Checkout Wait page, after an order is accepted, the UI shows only Cash on Delivery as the payment option (no Card/Stripe option, no QR code option).",
        "Attempting to access the removed payment actions from the UI is not possible (no visible buttons/links for Card/Stripe or QR payment).",
        "Completing Cash on Delivery updates the order payment reference to a Cash-on-Delivery marker (e.g., \"CASH_ON_DELIVERY\") and navigates the user to the Orders page.",
        "The checkout flow does not redirect the user to /payment-success or /payment-failure for normal Cash on Delivery usage."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Disable Stripe checkout session creation from the frontend when the app is configured for Cash on Delivery only, and show a clear English error message if any Stripe/card-payment action is attempted (e.g., via direct invocation).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-msg-1"
        ],
        "quotes": [
          "Change the payment method to accept only cash on delivery"
        ]
      },
      "acceptanceCriteria": [
        "The create-checkout-session mutation path is not called by any user-facing flow when Cash on Delivery is the only payment method.",
        "If code paths still attempt to invoke Stripe checkout session creation, the user receives an English error indicating that only Cash on Delivery is supported."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Enforce Cash on Delivery only at the backend by preventing creation of Stripe checkout sessions when Cash on Delivery is the only supported payment method.",
      "target": "backend",
      "source": {
        "messageIds": [
          "user-msg-1"
        ],
        "quotes": [
          "Change the payment method to accept only cash on delivery"
        ]
      },
      "acceptanceCriteria": [
        "Backend calls to createCheckoutSession fail with a clear trap/error when Cash on Delivery only mode is in effect.",
        "Existing non-Stripe order operations (createOrder, updateOrderPaymentRef, order queries) continue to work."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Remove or hide admin Stripe setup UI and any user-facing text that suggests card/Stripe payments are supported, updating text to state that payments are Cash on Delivery only.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-msg-1"
        ],
        "quotes": [
          "Change the payment method to accept only cash on delivery"
        ]
      },
      "acceptanceCriteria": [
        "The admin Stripe configuration dialog does not appear in normal admin usage when Cash on Delivery is the only payment method.",
        "User-facing copy in checkout/payment-related pages does not instruct users to pay by card/Stripe or QR code and instead references Cash on Delivery only.",
        "All updated user-facing text is in English."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister (all logic in backend/main.mo).",
    "Do not edit files under frontend/src/components/ui or any other paths listed as immutable in SYSTEM_CONTEXT.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding new payment providers or additional payment methods.",
    "Implementing third-party authentication beyond Internet Identity.",
    "Introducing external databases or non-Motoko backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}