{
  "kind": "build_request",
  "title": "Fix first-user admin bootstrap so Admin UI appears",
  "projectName": "HomeChef Kitchen",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-27",
      "text": "Fix the Motoko backend admin bootstrap so that when no admin is configured yet, the first authenticated principal to call the backend is permanently assigned the admin role, and subsequent users are not assigned admin automatically.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "admin is not showing to the first user"
        ]
      },
      "acceptanceCriteria": [
        "On a fresh canister (no admin assigned), the first Internet Identity user to make an authenticated backend call becomes the sole admin and remains admin after page refreshes and re-logins.",
        "After the first admin is assigned, a different principal logging in is not treated as admin and cannot access admin-only backend methods.",
        "The admin assignment is persisted in canister state (survives normal app usage and page refreshes)."
      ]
    },
    {
      "id": "REQ-28",
      "text": "Ensure the backend method used by the frontend to determine admin status (frontend calls `actor.isCallerAdmin()`) participates in the admin bootstrap logic so the first authenticated user immediately receives `true` from `isCallerAdmin()` after login.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "admin is not showing to the first user"
        ]
      },
      "acceptanceCriteria": [
        "On a fresh canister, calling `isCallerAdmin()` as the first authenticated user returns `true` on that same login session (no manual reset/redeploy required).",
        "If an admin is already assigned, `isCallerAdmin()` returns `true` only for that admin principal and `false` for all others.",
        "If the caller is anonymous/unauthenticated, `isCallerAdmin()` returns `false` (and does not assign admin)."
      ]
    },
    {
      "id": "REQ-29",
      "text": "Update the frontend so that immediately after a successful login, the UI re-checks admin status and updates navigation/admin gating without requiring a manual hard refresh, so the first user can see the \"Admin\" link as soon as they log in and are assigned admin.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "admin is not showing to the first user"
        ]
      },
      "acceptanceCriteria": [
        "After login, the navbar updates to show the \"Admin\" link as soon as `isCallerAdmin()` becomes `true`, without requiring a full page refresh.",
        "After logout, the \"Admin\" link disappears and admin-only pages show the existing English \"Access Denied\" UI for non-admin users.",
        "No changes are made to any files under `frontend/src/hooks/useInternetIdentity.ts` or other immutable paths listed in SYSTEM_CONTEXT."
      ]
    }
  ],
  "constraints": [
    "Backend must remain single-actor; all Motoko logic changes must stay in backend/main.mo (add migration.mo only if state schema changes require it).",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and frontend/src/components/ui sources.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not add new authentication providers or replace Internet Identity.",
    "Do not change Stripe payment functionality or payment messaging as part of this fix.",
    "Do not redesign the Admin Dashboard UI beyond what is required for admin link/gating to reflect correct admin status."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}