{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "HomeChef Kitchen — Refresh admin gating immediately after login",
  "requirements": [
    {
      "id": "REQ-29",
      "summary": "Refresh admin status immediately after login/logout so navbar and admin route gating update without a hard refresh.",
      "acceptanceCriteria": [
        "After login, the navbar updates to show the \"Admin\" link as soon as `isCallerAdmin()` becomes `true`, without requiring a full page refresh.",
        "After logout, the \"Admin\" link disappears and admin-only pages show the existing English \"Access Denied\" UI for non-admin users.",
        "No changes are made to any files under `frontend/src/hooks/useInternetIdentity.ts` or other immutable paths listed in SYSTEM_CONTEXT."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/LoginButton.tsx",
          "operation": "modify",
          "description": "After a successful Internet Identity login, force an immediate React Query refresh of admin-gating data by invalidating/refetching the `isCallerAdmin` query (and any other auth-derived queries if needed) so the Navbar updates without a hard refresh. Ensure logout continues to clear cached auth/admin state (align with the authorization component guidance for clearing cached application data on logout). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Harden `useIsCallerAdmin()` to reliably re-evaluate on identity changes by keying the query with the current principal (e.g., include principal string in the queryKey) and configuring refetch behavior so the first post-login render can observe the updated `actor.isCallerAdmin()` result. Keep UI text in English and preserve the existing Access Denied behavior via `RequireAdmin`. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}